read_liberty -lib sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog ha.v
synth -top ha
#dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
flatten
write_verilog -noattr netlist_ha.v
tee -o ha.rpt stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
show -prefix ./netlist_flatten -format jpeg
#!dot -Tpng netlist.dot -o netlist.png
