read_liberty -lib cmos_cells.lib
read_verilog design.sv
synth -top fa
#dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty cmos_cells.lib
clean
flatten
show -prefix ./netlist
